{
    "Tasks List": {
        "image" : "task-list",
        "color" : "pink",
        "link" : "task_list",
        "description" : "Create your own task list. Add a new task, remove existing one, or remove all of your tasks. Uses local storage so your tasks are not lost upon closing the browser. Made with Materialize and Material dialog."
    },
    "Loan Calculator": {
        "image" : "loan-calculator",
        "color" : "indigo",
        "link" : "loan_calculator",
        "description" : "Calculate the Monthly Payment, Total Payment and Total Interest of your loan, by inputing the Loan, Interest and Years to repay. Made with Bootstrap 4.5.2."
    },
    "Number Game": {
        "image" : "number-game",
        "color" : "blue-grey",
        "link" : "number_guesser",
        "description" : "Play a simple number game. You get three tryies to guess a random number from 1 to 10. Made with Skeleton."
    },
    "Book List": {
        "image" : "booklist",
        "color" : "deep-orange",
        "link" : "booklist",
        "description" : "Create a book list. Each book has a title, author and ISBN#. The list is saved using Local Storage. Made with Skeleton."
    },
    "Chuck Norris Jokes": {
        "image" : "chuck-norris-jokes-generator",
        "color" : "red",
        "link" : "chuck_norris_jokes",
        "description" : "Using the XMLHttpRequest object, an external API is called that returns jokes about Chuck Norris. The number of jokes depends on the inputed number."
    },
    "HTTP Library": {
        "image" : "easyHTTPExamle",
        "color" : "purple",
        "link" : "ajax_library",
        "description" : "Created a small library for making REST API calls with XMLHttpRequest object. Using prototypes instead of classes."
    },
    "HTTP Library 2": {
        "image" : "easyHTTPExamle2",
        "color" : "deep-purple",
        "link" : "fetch_library",
        "description" : "Small library for making REST API calls with fetch, using Promise and classes."
    },
    "HTTP Library 3": {
        "image" : "easyHTTPExamle3",
        "color" : "indigo",
        "link" : "fetch_library_await",
        "description" : "Upgrade of the previous library, using async and await."
    },
    "GitHub Users Finder": {
        "image" : "github-users",
        "color" : "cyan",
        "link" : "github_finder",
        "description" : "Using GitHub's API, search for a user by theirs username and output information about that user, including their latest 5 public repos. Uses Bootswatch for UI. API call made with Fetch using await and async."
    },
    "Weather App": {
        "image" : "weather-app",
        "color" : "blue",
        "link" : "weather_app",
        "description" : "An app that shows weather information for a chosen City. Uses Open Weather's API and local storage to remember the last searched city."
    },
    "User Form": {
        "image" : "form_validation",
        "color" : "teal",
        "link" : "form_validation",
        "description" : "User form that is validated using regular expressions. UI build using Bootstrap."
    },
    "Profile scroller": {
        "image" : "profile_scroller",
        "color" : "lime",
        "link" : "profile_scroller",
        "description" : "Small app that uses iterator function to scroll through people's dating profile. UI build using Bootstrap."
    }
}

